app/views/bookings/index.html.erb

					<% if @atArcade != @null %>
						<% booking.delete %>
---
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 10]]