app/controllers/bookings_controller.rb

	def create
		@booking = Booking.new(params[:booking].permit(:station, :name, :time))
		if @booking.save
---
INSERT INTO "bookings" ("created_at", "name", "station", "time", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 05 Mar 2014 16:17:57 UTC +00:00], ["name", "asdasdasd"], ["station", "dasdasd"], ["time", "asdasdasd"], ["updated_at", Wed, 05 Mar 2014 16:17:57 UTC +00:00]]

	def destroy
		@booking = Booking.find(params[:id])
		@booking.destroy
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]

	def show
		@booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? ORDER BY "bookings"."id" ASC LIMIT 1  [["id", 2]]

	def edit
		@booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "2"]]

	def update
		@booking = Booking.find(params[:id])

		if @booking.update(params[:booking].permit(:station, :name, :time))
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "bookings" SET "station" = ?, "name" = ?, "updated_at" = ? WHERE "bookings"."id" = 54  [["station", "Foosball"], ["name", "SHAZAM and Graham's Little Brother"], ["updated_at", Fri, 07 Mar 2014 18:14:34 UTC +00:00]]