app/controllers/comments_controller.rb

  def create
    @booking = Booking.find(params[:booking_id])
    @comment = @booking.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "booking_id", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "dfgdfgdfg"], ["booking_id", 2], ["commenter", "fgdfgf"], ["created_at", Wed, 05 Mar 2014 19:38:25 UTC +00:00], ["updated_at", Wed, 05 Mar 2014 19:38:25 UTC +00:00]]

  def destroy
    @booking = Booking.find(params[:booking_id])
    @comment = @booking.comments.find(params[:id])
    @comment.destroy
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."booking_id" = ? AND "comments"."id" = ? LIMIT 1  [["booking_id", 2], ["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]